# DATA WAREHOUSE TESTS

In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

# DOMAIN INTEGRITY CHECKS

In [7]:
%%sql
-- Checks database tables and columns within

SELECT * FROM sqlite_master;

 * sqlite:///CourseDataWarehouse.db
Done.

[('table', 'PROGRAMS_DW', 'PROGRAMS_DW', 2, 'CREATE TABLE PROGRAMS_DW (\n    Program_id INTEGER PRIMARY KEY,\n    program_code TEXT NOT NULL,\n    program_name TEXT NOT NULL\n)'),
 ('table', 'PROFESSORS_DW', 'PROFESSORS_DW', 3, 'CREATE TABLE PROFESSORS_DW (\n    Professor_id INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'LOCATIONS_DW', 'LOCATIONS_DW', 4, 'CREATE TABLE LOCATIONS_DW (\n    Location_id INTEGER PRIMARY KEY,\n    location TEXT NOT NULL\n)'),
 ('table', 'TIMECODES_DW', 'TIMECODES_DW', 5, 'CREATE TABLE TIMECODES_DW (\n    Timecode_id INTEGER PRIMARY KEY,\n    Day TEXT,\n    Start TEXT NOT NULL,\n    End TEXT NOT NULL\n)'),
 ('table', 'COURSES_DW', 'COURSES_DW', 6, 'CREATE TABLE COURSES_DW (\n    Course_id INTEGER PRIMARY KEY, \n    CatalogYear TEXT NOT NULL,\n    Catalog_id TEXT NOT NULL,\n    Course_title TEXT NOT NULL,\n    Credits TEXT NOT NULL,\n    Program_id INTEGER,\n    FOREIGN KEY (Program_id) REFERENCES PROGRAMS_DW(Program_id)\n)'),
 ('table', 'CLASS_FACTS_DW', 'CLASS_FACTS_DW', 7, 'CREATE TABLE CLASS_FACTS_DW (\n    Course_id INTEGER,\n    Program_id INTEGER,\n    Location_id INTEGER,\n    Professor_id INTEGER,\n    Offering_id  ... (528 characters truncated) ... d),\n    FOREIGN KEY (Location_id) REFERENCES LOCATIONS_DW(Location_id),\n    FOREIGN KEY (Professor_id) REFERENCES PROFESSORS_DW(Professor_id)   \n)'),
 ('table', 'OFFERING_TIMECODE', 'OFFERING_TIMECODE', 8, 'CREATE TABLE OFFERING_TIMECODE(\n  Day TEXT,\n  StartTime,\n  EndTime,\n  Offering_id INT,\n  Timecode_id INT\n)')]

In [17]:
%%sql
-- check that the correct number of records are retrieved

SELECT 
    (SELECT Count(*) FROM COURSES_DW) as CatalogCourses,
    (SELECT Count(*) FROM PROFESSORS_DW) as Professors,
    (SELECT Count(*) FROM LOCATIONS_DW) as LocationMeetings

 * sqlite:///CourseDataWarehouse.db
Done.

[(4440, 1104, 207)]

## ENTITY INTEGRITY CHECKS

In [25]:
%%sql 
-- Testing COURSES_DW Table to retrieve specific courses

SELECT *
FROM COURSES_DW
WHERE Program_id = 47
GROUP BY Course_title
HAVING Course_title LIKE '%Analytics';

 * sqlite:///CourseDataWarehouse.db
Done.

[(1152, '2017_2018', 'IS 0510', 'Databases for Business Analytics', '3 Credits', 47),
 (921, '2017_2018', 'IS 0210', 'Fundamentals of Business Analytics', '3 Credits', 47),
 (1151, '2017_2018', 'IS 0505', 'Python for Business Analytics', '3 Credits', 47)]

In [30]:
%%sql 
-- Testing CLASS_FACTS_DW Table to retrieve a unique value

SELECT DISTINCT Term, CatalogYear, Credits, Section
FROM CLASS_FACTS_DW
WHERE Term = 'Fall2018' and Section = '01C' 
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Fall2018', '2018_2019', 3.0, '01C'),
 ('Fall2018', '2018_2019', 4.0, '01C'),
 ('Fall2018', '2018_2019', 1.0, '01C')]

## RELATIONAL INTEGRITY CHECKS

## Which programs do Professor Huntley teach?

In [13]:
%%sql
SELECT DISTINCT Name,Program_Code
FROM PROFESSORS_DW
    JOIN CLASS_FACTS_DW USING(Professor_id)
    JOIN COURSES_DW USING(Course_id)
    JOIN PROGRAMS_DW USING(Program_id)
WHERE Name LIKE '%Huntley%'
;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Christopher L.  Huntley', 'IS'), ('Christopher L.  Huntley', 'OM')]